# CanMirrorElements Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementTransformUtils..::..CanMirrorElements Method
ElementTransformUtils Class See Also
---
Determines whether elements can be mirrored.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static bool CanMirrorElements(
	Document ADoc,
	ICollection<ElementId> elemIds
)
```

Visual Basic
---
```text
Public Shared Function CanMirrorElements ( _
	ADoc As Document, _
	elemIds As ICollection(Of ElementId) _
) As Boolean
```

Visual C++
---
```text
public:
static bool CanMirrorElements(
	Document^ ADoc,
	ICollection<ElementId^>^ elemIds
)
```

# ### Parameters
ADoc
    Type: Autodesk.Revit.DB..::..Document The document where the elements reside.
elemIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The elements identified by id.
# ### Return Value
True if the elements can be mirrored.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ElementTransformUtils Class
Autodesk.Revit.DB Namespace